{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<s>": 1,
      "</s>": 2,
      "<pad>": 3,
      "H": 4,
      "T": 5,
      "a": 6,
      "d": 7,
      "e": 8,
      "g": 9,
      "i": 10,
      "l": 11,
      "n": 12,
      "o": 13,
      "r": 14,
      "t": 15,
      "w": 16,
      "Ġ": 17,
      "in": 18,
      "He": 19,
      "Tr": 20,
      "at": 21,
      "ain": 22,
      "dat": 23,
      "ld": 24,
      "ll": 25,
      "or": 26,
      "wor": 27,
      "Ġdat": 28,
      "Ġwor": 29,
      "ing": 30,
      "Hell": 31,
      "Train": 32,
      "Ġdata": 33,
      "Ġworld": 34,
      "Hello": 35,
      "Training": 36
    },
    "merges": [
      [
        "i",
        "n"
      ],
      [
        "H",
        "e"
      ],
      [
        "T",
        "r"
      ],
      [
        "a",
        "t"
      ],
      [
        "a",
        "in"
      ],
      [
        "d",
        "at"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "l"
      ],
      [
        "o",
        "r"
      ],
      [
        "w",
        "or"
      ],
      [
        "Ġ",
        "dat"
      ],
      [
        "Ġ",
        "wor"
      ],
      [
        "in",
        "g"
      ],
      [
        "He",
        "ll"
      ],
      [
        "Tr",
        "ain"
      ],
      [
        "Ġdat",
        "a"
      ],
      [
        "Ġwor",
        "ld"
      ],
      [
        "Hell",
        "o"
      ],
      [
        "Train",
        "ing"
      ]
    ]
  }
}